** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.3.mceval.scm")
  ;; Test
  (mc-print '((list 'testing 'the 'data-directed 'evaluator:)
              (list 'self-evaluating: 1)
              (begin (define x 20)
                     (list 'variable: 'x 'is x))
              (begin (list 'quoted: (quote some-text)))
              (begin (define y 20)
                     (define res-assignment (list 'assignment: 'y 'is y '-))
                     (set! y 22)
                     (append res-assignment (list 'now 'it 'is y)))
              (begin (define x 10)
                     (list 'define: 'x 'is x))
              (list 'if: (if (< 1 0) (error) 'pass))
              ((lambda () (list 'lambda: 'pass)))
              (begin (define x (list 'pass))
                     (cons 'begin: x))
              (list 'cond: (cond ((< 1 0) 'fail)
                                 ((> 0 1) 'fail)
                                 (else 'pass)))
              ((lambda () (list 'application: 'pass)))
              (list 'pass!)))
#+end_src

#+RESULTS:
#+begin_example
(testing the data-directed evaluator:)
(self-evaluating: 1)
(variable: x is 20)
(quoted: some-text)
(assignment: y is 20 - now it is 22)
(define: x is 10)
(if: pass)
(lambda: pass)
(begin: pass)
(cond: pass)
(application: pass)
(pass!)
#+end_example
